Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/mortgage_protection.html.txt.tmx
Source language: en
Languages: ga

source: Insurance protection on mortgages
ga: Polasaithe árachais chun do mhorgáiste a chosaint

source: • Mortgage repayment protection insurance
ga: • Árachas um chosaint aisíocaíocht morgáiste

source: When taking out a mortgage, you need to consider how it will be paid off in the event of your death
ga: Nuair a ghlacann tú morgáiste, ní mór duit smaoineamh faoi conas a aisíocfar é, sa chás go bhfaigheann tú bás

source: You may also consider how to continue repayments if your income falls, due to illness, unemployment or other reasons
ga: D'fhéadfá smaoineamh, freisin, ar conas aisíocaíochtaí a leanúint má thagann laghdú ar d'ioncam, mar gheall ar bhreoiteacht, ar dhífhostaíocht no ar chúiseanna eile

source: ‘Mortgage protection’ insurance is designed to pay off your mortgage in full if you die before the mortgage has been fully paid
ga: Tá ‘árachas um chosaint mhorgáiste’ in ainm is do mhorgáiste a aisíoc go hiomlán má fhaigheann tú bás sular íocadh as an morgáiste go hiomlán

source: ‘Mortgage repayment protection’ insurance is designed to cover your repayments for a period in certain circumstances
ga: Tá ‘árachas um aisíocaíocht morgáiste’ in ainm is íoc as d’aisíocaíochtaí ar feadh tréimhse faoi chúinsí áirithe

source: When you get a mortgage to buy your home, you will generally be required to take out mortgage protection insurance
ga: Nuair a fhaigheann tú morgáiste chun do theach a cheannach, is gnách go mbeidh ort árachas um chosaint mhorgáiste a fháil

source: This is a particular type of life assurance taken out for the term of the mortgage and designed to pay it off on the death of the borrower or joint borrower
ga: Is saghas ar leith árachas saoil seo a ghlactar do théarma an mhorgáiste agus tá sé in ainm is íoc as an morgáiste ar bhás an iasachtaí nó an chomhiasachtaí

source: In most cases, the lender is legally required under Section 126 of the Consumer Credit Act 1995 to make sure that you have mortgage protection insurance before giving you a mortgage, with some exceptions – see ‘Exceptions to legal requirement’ below
ga: I dtromlach na gcásanna, tá dualgas dlíthiúil ar an iasachtóir, faoin Acht um Chreidmheas do Thomhaltóirí 1995, a chinntiú go bhfuil árachas um chosaint mhorgáiste agat sula dtugtar morgáiste duit. Tá roinnt eisceachtaí ann ina thaobh seo, féach ‘Eisceachtaí leis an gceanglas dlíthiúil’ thíos

source: However, if the lender offers a particular policy, you are not required to buy it
ga: Má dhéanann an iasachtóir polasaí a leith a thairiscint duit, áfach, níl dualgas ort é a cheannach

source: You can shop around for a mortgage protection policy that suits your needs
ga: Féadfaidh tú do pholasaí um chosaint mhorgáiste féin a fháil a oireann do do chuid riachtanas

source: Your lender cannot refuse you a mortgage because you don't buy the policy it offers
ga: Ní féidir le d’iasachtóir morgáiste a dhiúltú duit mar gheall nach gceannaíonn tú an polasaí a dhéanann siad a thairiscint

source: Mortgage protection should be payable on a joint life, first death basis
ga: Ba cheart go mbeadh cosaint mhorgáiste iníoctha ar bhonn comh-shaoil, chéad báis

source: This means that the mortgage is repaid on the death of the first borrower if a couple is involved
ga: Ciallaíonn seo go n-aisíoctar an morgáiste ar bhás an chéad iasachtaí má bhíonn lánúin i gceist

source: It is important to review your mortgage protection policy regularly and ensure that you take out additional cover, if necessary, to cover extensions of the mortgage term or any penalties incurred
ga: Is tábhachtach athbhreithniú a dhéanamh ar do bheartas um chosaint mhorgáiste go rialta agus a chinntiú go nglacann tú breis cumhdaigh, más gá, chun síntí théarma an mhorgáiste nó aon phionóis a thabhaítear a chumhdach

source: You must keep the premiums up to date
ga: Ní mór na préimheanna a choimeád cothrom le dáta

source: If you go into arrears, the policy may lapse
ga: Má ghabhann tú chun riaráistí, seans go rachaidh an polasaí i léig

source: The Competition and Consumer Protection Commission publishes detailed information on mortgage protection insurance
ga: Foilsíonn an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí faisnéis shonrach ar árachas um chosaint mhorgáiste

source: Exceptions to legal requirement
ga: Eisceachtaí leis an gceanglas dlíthiúil

source: You do not have to take out mortgage protection insurance if:
ga: Níl ort árachas um chosaint mhorgáiste a fháil:

source: • You are aged over 50 or
ga: • Má tá tú breis agus 50 bliain d’aois, nó

source: • The mortgage is not on your principal private residence (your home) or
ga: • Níl an morgáiste ar d’áit chónaithe phríobháideach phríomha (do theach cónaithe), nó

source: • You cannot get the insurance, or can only get it at a much higher premium than normal or
ga: • Ní féidir leat an t-árachas a fháil, nó ní féidir leat é a fháil seachas ar phréimh atá i bhfad níos airde ná mar is gnách, nó

source: • You already have enough life insurance to pay off the home loan if you die
ga: • Tá agat dóthain árachas saoil cheana féin agat chun íoc as an iasacht tí má fhaigheann tú bás

source: However, some lenders may insist that you take out mortgage protection insurance as a condition of giving you a mortgage, even if there is no legal requirement in your case
ga: D’fhéadfadh roinnt iasachtóirí a chur ina luí ort gur coinníoll an t-árachas seo lena mbaineann morgáiste a thabhairt duit, fiú muna bhfuil ceanglas dlíthiúil i gceist i do chás

source: Mortgage repayment protection insurance
ga: Árachas um chosaint aisíocaíocht morgáiste

source: Mortgage repayment protection insurance is usually optional
ga: Is gnách go mbíonn rogha agat chun árachas um chosaint aisíocaíocht morgáiste a fháil

source: It is a type of payment protection insurance that is designed to repay your mortgage for a certain amount of time – typically 12 months – if your income is reduced because you have an accident or are made redundant, or for any other reason covered by the particular policy
ga: Is saghas árachas um chosaint íocaíochta atá ina ainm is do mhorgáiste a aisíoc ar feadh tréimhse áirithe ama – de ghnáth 12 mhí – má thagann laghdú ar d’ioncam mar gheall go raibh timpiste agat nó go ndearnadh iomarcach thú, nó ar chúis ar bith eile a chuimsíonn an beartas áirithe

source: You should check with your mortgage lender or insurance broker or insurance company if you are uncertain about whether you have mortgage repayment protection insurance
ga: Ba cheart duit a sheiceáil le d’iasachtóir morgáiste nó le do bhróicéir árachais nó do chuideachta árachais mura bhfuil tú cinnte faoi cibé acu an bhfuil árachas um chosaint aisíocaíocht morgáiste agat

source: You should also check exactly what it covers and ensure that it suits your situation
ga: Ba cheart duit a sheiceáil, chomh maith leis sin, céard go díreach a chumhdaíonn sé agus a chinntiú go n-oireann sé do do chás

source: The Competition and Consumer Protection Commission publishes detailed information on payment protection insurance in general
ga: Foilsíonn an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí faisnéis shonrach ar árachas um chosaint íocaíocht morgáiste go ginearálta
